InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.СервисныеЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СхемыНалогообложенияКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СхемыНалогообложенияКонтрагентов</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СхемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СхемыНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаПлательщикаЕдиногоНалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыПлательщиковЕдиногоНалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыКонтактныхЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыКонтактныхЛиц</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КонтактноеЛицоКонтрагента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееКонтактноеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныйКонтакт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/КонтактныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>КонтактныеЛица</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейДоНапоминания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминатьОДнеРождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидКонтактногоЛица</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКонтактныхЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКонтрагентДляОграниченияПравДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОбъектВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПользовательДляОграниченияПравДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРоль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиКонтактныхЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СхемыНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>СхемыНалогообложения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НалогНаПрибыль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиныйНалог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/Пактум_Общий/Ext/Module.bsl
Функция ПолучитьКонтрагента(КодЕДРПОУ, Код = "") Экспорт
	
	Стру=Новый Структура("Контрагент, спКонтрагенты, Кво", Неопределено, Новый СписокЗначений, 0);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка
	|	,Контрагенты.Код
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.КодПоЕДРПОУ = &КодПоЕДРПОУ
	|";
	Запрос.УстановитьПараметр("КодПоЕДРПОУ", КодЕДРПОУ);
	Запрос.УстановитьПараметр("Код", Код);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат Стру;
	КонецЕсли;
	
	Выб = Рез.Выбрать();
	Пока Выб.Следующий() Цикл
		Если Код="" Тогда
			Стру.Вставить("Контрагент", Выб.Ссылка);
			Стру.спКонтрагенты.Добавить(Выб.Ссылка);
			Прервать;
		Иначе
			Если Выб.Код=Код Тогда
				Стру.Вставить("Контрагент", Выб.Ссылка);
			КонецЕсли;
			Стру.спКонтрагенты.Добавить(Выб.Ссылка);
		КонецЕсли;
	КонецЦикла;
	Стру.Вставить("Кво", Выб.Количество());
	
	Возврат Стру;
	
КОнецФункции

Процедура НайтиИЗаписать_Пактум(пФорма, Конфигурация) Экспорт
	
	Парам=Новый Структура;
	Парам.Вставить("Конфигурация", Конфигурация);
	Парам.Вставить("Форма", пФорма);
	Парам.Вставить("ЕДРПОУ", СокрЛП(пФорма.КодПоЕДРПОУ));
	Парам.Вставить("Код", пФорма.Код);
	Парам.Вставить("КонтрагентСсылка", пФорма.Ссылка);
	
	пФизЛицо=Ложь;
	Если Конфигурация="БУ" Или Конфигурация="УТП" Тогда
		Если пФорма.ЮрФизЛицо=ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо") Тогда
			пФизЛицо=Истина;
		КонецЕсли;
	Иначе
		Если пФорма.ЮридическоеФизическоеЛицо=ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда
			пФизЛицо=Истина;
		КонецЕсли;
	КонецЕсли;
	Парам.Вставить("ФизЛицо", пФизЛицо);
	
	Если пФизЛицо Тогда
		пФорма.ЭлементыФормы.ЗаполнитьПоЕГРПОУ1.Видимость=Ложь;
		пФорма.ЭлементыФормы.ДекорацияЗаполнитьПоЕГРПОУ1.Видимость=Истина;
		Парам.Вставить("ПрогрессБар", пФорма.ЭлементыФормы.ДекорацияЗаполнитьПоЕГРПОУ1);
		Парам.Вставить("КнопкаЗаполнить", пФорма.ЭлементыФормы.ЗаполнитьПоЕГРПОУ1);
		НаименованиеКодаДляСтрокиСостояния = "ДРФО";
	Иначе
		пФорма.ЭлементыФормы.ЗаполнитьПоЕГРПОУ.Видимость=Ложь;
		пФорма.ЭлементыФормы.ДекорацияЗаполнитьПоЕГРПОУ.Видимость=Истина;
		Парам.Вставить("ПрогрессБар", пФорма.ЭлементыФормы.ДекорацияЗаполнитьПоЕГРПОУ);
		Парам.Вставить("КнопкаЗаполнить", пФорма.ЭлементыФормы.ЗаполнитьПоЕГРПОУ);
		НаименованиеКодаДляСтрокиСостояния = "ЕГРПОУ"; 
	КонецЕсли;
	пФорма.Обновить();
	Состояние(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Выполняется поиск контрагента по ';uk='Виконується пошук контрагента по '")+
				НаименованиеКодаДляСтрокиСостояния+НСтр("ru=': %1. Нужно подождать...';uk=': %1. Треба почекати...'"),СокрЛП(пФорма.КодПоЕДРПОУ)));
	
	
	Налогообложение=Новый Структура;
	Налогообложение.Вставить("СистемаНалогообложения", Неопределено);
	Налогообложение.Вставить("СистемаНалогообложенияТекст", "");
	Налогообложение.Вставить("ПериодНалогообложения", Дата(1, 1, 1, 0, 0, 0));
	Налогообложение.Вставить("ОчиститьИНН", Ложь);
	
	Парам.Вставить("Налогообложение", Налогообложение);
	Парам.Вставить("КолЦиклов", 0);
	Парам.ПрогрессБар.МаксимальноеЗначение=18;
	Парам.ПрогрессБар.Значение=0;
	
	Пактум_НачатьПоиск(Парам);
	
	пФорма.Модифицированность = Ложь;
	пФорма.Пактум_ЗаполненСервисом = Истина;
	пФорма.Закрыть();
	Оповестить("Пактум.НовыйКонтрагент", Парам.КонтрагентСсылка);
	ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта", Новый Структура("Ключ", Парам.КонтрагентСсылка));
	
	Парам.ПрогрессБар.Значение=0;
	Состояние("");
	
КонецПроцедуры

Процедура Пактум_НачатьПоиск(Парам)
	
	Парам.ПрогрессБар.Значение = Парам.ПрогрессБар.Значение + 1;
	СтруАвторизация=Пактум_Сервер.Авторизация_Пактум();
	Токен=СтруАвторизация.Токен;
	Если Токен=Неопределено Тогда
		Парам.ПрогрессБар.Видимость = Ложь;
		Парам.КнопкаЗаполнить.Видимость = Истина;
		Сообщить(НСтр("ru='Авторизация Пактум.Контрагент не пройдена. Для настройки доступа обратитесь к администратору.';uk='Авторизація Пактум.Контрагент не пройдена. Для настройки доступу зверніться до адміністратора.'"));
		Возврат;
	КонецЕсли;
	НастройкиПодключения=Пактум_Сервер.ПолучитьНастройкиПодключения();
	WinHttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");
	WinHttp.Option(2,"utf-8");
	WinHttp.Open("Get","https://pactumsys.com/api/v1/cba2911c-01f9-4ca7-833a-46fb0cc079f2/contractors/"+Парам.ЕДРПОУ+"?source=1c",0);
	WinHttp.SetRequestHeader("Accept-Language", "ru");
	WinHttp.SetRequestHeader("Accept-Charset","utf-8");
	WinHttp.setRequestHeader("Content-Language", "ru");
	WinHttp.setRequestHeader("Content-Charset", "utf-8");
	WinHttp.setRequestHeader("Authorization", "Bearer "+СтруАвторизация.Токен);
	WinHttp.setRequestHeader("Content-type", "application/x-www-form-urlencoded; charset=utf-8");
	ПараметрыПОСТ = "";
	Если НастройкиПодключения.фИспользоватьПрокси Тогда
		WinHttp.SetProxy(2, СокрЛП(НастройкиПодключения.АдресПрокси)+":"+СокрЛП(НастройкиПодключения.ПортПрокси));
		Если НастройкиПодключения.фИспользоватьЛогинПарольПрокси Тогда
   			WinHttp.SetCredentials(СокрЛП(НастройкиПодключения.ЛогинПрокси), СокрЛП(НастройкиПодключения.ПарольПрокси), 1);
		КонецЕсли;
	КонецЕсли;
	
	фВсеОК=Истина;
	Попытка
		WinHttp.Send(ПараметрыПОСТ);
	Исключение
		фВсеОК=Ложь;
	КонецПопытки;
	
	ТекстОтвета="";
	Если фВсеОК Тогда
		Попытка
			ТекстОтвета = WinHttp.ResponseText();
		Исключение
			фВсеОК=Ложь;
		КонецПопытки;
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON; 
	ЧтениеJSON.УстановитьСтроку( ТекстОтвета);
	Контрагент = ПрочитатьJSON (ЧтениеJSON);
	
	Если Контрагент.Свойство("Status") Тогда
		пСтатус1=""; пСтатус2=""; пСтатус3="";
		Для Каждого ст Из Контрагент.RegisterStates Цикл
			Если ст.RegisterId = 1 Тогда	//ЕДР
				пСтатус1 = ст.Status;
			ИначеЕсли ст.RegisterId = 2 Тогда	//ЕН
				пСтатус2 = ст.Status;
			ИначеЕсли ст.RegisterId = 3 Тогда	//НДС
				пСтатус3 = ст.Status;
			КонецЕсли;
		КонецЦикла;
		Если пСтатус1="Done" И пСтатус2="Done" И пСтатус3="Done" Тогда
			Пактум_ЗаполнитьКонтрагента(Контрагент, Парам);
			Пактум_ЗавершениеПоиска(Парам);
			КолЦиклов=0;
		ИначеЕсли Парам.КолЦиклов < 18  тогда
			Пактум_Клиент.Sleep(10);
			Парам.КолЦиклов = Парам.КолЦиклов + 1;  
			Пактум_НачатьПоиск(Парам);
		Иначе
			СтатусЕДР=пСтатус1;	//ЕДР должен ответить...
			Если СтатусЕДР = "Done" Тогда
				Пактум_ЗаполнитьКонтрагента(Контрагент, Парам);
			КонецЕсли;
			
			КодОшибки=0;
			ТекстОшибки="";
			Для Каждого ст Из Контрагент.RegisterStates Цикл
				Если ст.Status ="Done" Тогда
					Продолжить;
				КонецЕсли;
				Если ст.RegisterId = 1 Тогда		//ЕДР
					КонтрагентСсылка = Справочники.Контрагенты.НайтиПоРеквизиту("КодПоЕДРПОУ", Парам.ЕДРПОУ);
					Если КонтрагентСсылка = Справочники.Контрагенты.ПустаяСсылка() Тогда
						КодОшибки=4;
					Иначе
						КодОшибки=5;
					КонецЕсли;
				ИначеЕсли ст.RegisterId = 2 Тогда	//ЕН
					Если КодОшибки=0 Тогда
						КодОшибки=1;
					Иначе
						Если КодОшибки<4 Тогда
							КодОшибки=3;
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли ст.RegisterId = 3 Тогда	//НДС
					Если КодОшибки=0 Тогда
						КодОшибки=2;
					Иначе
						Если КодОшибки<4 Тогда
							КодОшибки=3;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Если КодОшибки=0 Тогда
				КонтрагентСсылка = Справочники.Контрагенты.НайтиПоРеквизиту("КодПоЕДРПОУ", Парам.ЕДРПОУ);
				Если КонтрагентСсылка = Справочники.Контрагенты.ПустаяСсылка() Тогда
					КодОшибки=4;
				Иначе
					КодОшибки=5;
				КонецЕсли;
			КонецЕсли;
			ТекстОшибки=ПолучитьТекстОшибкиРеестров(КодОшибки);
			Пактум_ЗавершениеПоиска(Парам, Истина, ТекстОшибки);
			Парам.КолЦиклов = 0;
			Пактум_Клиент.РазблокироватьФорму(Парам);
		КонецЕсли;
	Иначе
		Пактум_ЗавершениеПоиска(Парам, Истина, Контрагент.Message);
		Парам.КолЦиклов = 0;
		Пактум_Клиент.РазблокироватьФорму(Парам);
	КонецЕсли;
	
КонецПроцедуры

Процедура Пактум_ЗаполнитьКонтрагента(Контрагент, Парам)
	
	Контрагенты = Парам.КонтрагентСсылка.ПолучитьОбъект();
	Контрагенты.Наименование = Контрагент.Name;
	Контрагенты.НаименованиеПолное = Контрагент.FullName;
	Контрагенты.КодПоЕДРПОУ = СокрЛП(Контрагент.Identifier);
	Контрагенты.ИНН = СокрЛП(Контрагент.IndividualTaxNumber);
	Контрагенты.ЮрФизЛицо  = Перечисления.ЮрФизЛицо.ЮрЛицо;
	Если Не Контрагент.IsFop = Неопределено Тогда
		Если Контрагент.IsFop = Истина Тогда
			Контрагенты.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;	
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(Контрагент.VatCertificate) Тогда
		Контрагенты.НомерСвидетельства = Контрагент.VatCertificate;
	КонецЕсли;
	Контрагенты.Записать();
	// Додаєм записи по регістр
	Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	Запись.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
	Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	Запись.Объект = Контрагенты.Ссылка;
	Если Контрагент.IsAddressElements=0 Тогда
		Запись.Представление = Контрагент.Address;
	Иначе
		Запись.Поле10=Контрагент.Address_country;
		Запись.Поле5=Контрагент.Address_atu;
		Запись.Поле6=Контрагент.Address_street;
		Запись.Поле7=Контрагент.Address_house;
		Запись.Поле8=Контрагент.Address_building;
		Запись.Поле9=Контрагент.Address_num;
		Запись.Поле1=Контрагент.Address_zip;
		//Запись.Представление = УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдреса(Запись);
		Запись.Представление = Контрагент.Address;
	КонецЕсли;
	Запись.Записать();
	
	
	СтрокаТелефоны = "";
	Если Не Контрагент.Contacts_Phones = Неопределено Тогда
		Если Контрагент.Contacts_Phones.Количество() > 0 Тогда
			Для Каждого ТелНомер Из Контрагент.Contacts_Phones Цикл
				Если ПустаяСтрока(ТелНомер) Тогда
					Продолжить;
				КонецЕсли;
				СтрокаТелефоны = СтрокаТелефоны + ?(СтрокаТелефоны="", "", ", ") + СокрЛП(ТелНомер);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПустаяСтрока(СтрокаТелефоны) Тогда
		Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
		Запись.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
		Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		Запись.Объект = Контрагенты.Ссылка;
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Запись.Представление = 	СтрокаТелефоны;
		Иначе
			Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
			Запись.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
			Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			Запись.Объект = Контрагенты.Ссылка;
			Запись.Представление = 	СтрокаТелефоны;
		КонецЕсли;
		Запись.Записать();
	КонецЕсли;
	
	Если Не ПустаяСтрока(Контрагент.Contacts_Fax) Тогда
		Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
		Запись.Вид = Справочники.ВидыКонтактнойИнформации.ФаксКонтрагента;
		Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		Запись.Объект = Контрагенты.Ссылка;
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Запись.Представление = Контрагент.Contacts_Fax;
		Иначе
			Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
			Запись.Вид = Справочники.ВидыКонтактнойИнформации.ФаксКонтрагента;
			Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			Запись.Объект =Контрагенты.Ссылка;
			Запись.Представление = Контрагент.Contacts_Fax;
		КонецЕсли;
		Запись.Записать();
	КонецЕсли;
		
	Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	Запись.Вид = Справочники.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя;
	Запись.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	Запись.Объект =Контрагенты.Ссылка;
	Запись.Прочитать();
	Если Запись.Выбран() тогда
		Запись.Представление = 	Контрагент.Email;
	иначе
		Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
		Запись.Вид = Справочники.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя;
		Запись.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		Запись.Объект =Контрагенты.Ссылка;
		Запись.Представление = 	Контрагент.Email;
		
	КонецЕсли;
	Запись.Записать();
	
	спКонтакты=ПолучитьКонтактыКонтрагента(Контрагент);
	Если спКонтакты.Количество()>0 Тогда
		Для Х=1 По спКонтакты.Количество() Цикл
			пКонтакт=спКонтакты[Х-1];
			Если Не Метаданные.Справочники.КонтактныеЛица.Реквизиты.Найти("ОбъектВладелец")=Неопределено Тогда
				Зап=Новый Запрос;
				Зап.Текст=
				"ВЫБРАТЬ
				|	КонтактныеЛица.Ссылка
				|ИЗ
				|	Справочник.КонтактныеЛица КАК КонтактныеЛица
				|ГДЕ
				|	КонтактныеЛица.Наименование = &Наименование
				|	И КонтактныеЛица.ОбъектВладелец = &ОбъектВладелец
				|	И КонтактныеЛица.ВидКонтактногоЛица = &ВидКонтактногоЛица";
				Зап.УстановитьПараметр("Наименование", пКонтакт.Значение);
				Зап.УстановитьПараметр("ОбъектВладелец", Контрагенты.Ссылка);
				Зап.УстановитьПараметр("ВидКонтактногоЛица", Перечисления.ВидыКонтактныхЛиц.КонтактноеЛицоКонтрагента);
				Рез=Зап.Выполнить();
				Если Рез.Пустой() Тогда
					КонтактныеЛица = Справочники.КонтактныеЛица.СоздатьЭлемент();
				 Иначе
					Выб=Рез.Выбрать();
					Выб.Следующий();
					КонтактныеЛица = Выб.Ссылка.ПолучитьОбъект(); 
				КонецЕсли;
			Иначе
				КонтактныеЛицаСсылка = Справочники.КонтактныеЛица.НайтиПоНаименованию(пКонтакт.Значение);
				Если КонтактныеЛицаСсылка = Справочники.КонтактныеЛица.ПустаяСсылка() тогда
					КонтактныеЛица = Справочники.КонтактныеЛица.СоздатьЭлемент();
				Иначе
					КонтактныеЛица = КонтактныеЛицаСсылка.ПолучитьОбъект();
				КонецЕсли;
			КонецЕсли;
			Если Х=1 Тогда
				КонтактныеЛица.Фамилия =Контрагент.DirectorLastName;
				КонтактныеЛица.Имя =Контрагент.DirectorFirstName;
				КонтактныеЛица.Отчество =Контрагент.DirectorMiddleName;
			КонецЕсли;
			Если  Парам.Конфигурация = "БУ" тогда
				КонтактныеЛица.ОбъектВладелец =Контрагенты.Ссылка;
				КонтактныеЛица.ВидКонтактногоЛица=Перечисления.ВидыКонтактныхЛиц.КонтактноеЛицоКонтрагента;
			КонецЕсли;
			КонтактныеЛица.Наименование =пКонтакт.Значение; 
			КонтактныеЛица.Записать();
			Если  Парам.Конфигурация = "УПП" или Парам.Конфигурация = "УТП"  тогда
				КонтактныеЛицаКонтрагентаСсылка = Справочники.КонтактныеЛицаКонтрагентов.НайтиПоНаименованию(пКонтакт.Значение,,,Контрагенты.Ссылка);
				Если КонтактныеЛицаКонтрагентаСсылка = Справочники.КонтактныеЛицаКонтрагентов.ПустаяСсылка() тогда
					КонтактныеЛицаКонтрагента = Справочники.КонтактныеЛицаКонтрагентов.СоздатьЭлемент();
				Иначе
					КонтактныеЛицаКонтрагента = КонтактныеЛицаКонтрагентаСсылка.ПолучитьОбъект();
				КонецЕсли;				
				КонтактныеЛицаКонтрагента.КонтактноеЛицо = КонтактныеЛица.Ссылка;
				КонтактныеЛицаКонтрагента.Владелец =Контрагенты.Ссылка;
				КонтактныеЛицаКонтрагента.Наименование =пКонтакт.Значение; 
				КонтактныеЛицаКонтрагента.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
	ПолучитьНалогообложение(Контрагент, Парам);
	
КонецПроцедуры

Функция ПолучитьКонтактыКонтрагента(Контрагент)
	
	Сп=Новый СписокЗначений;
	//Первый - директор, есть в структуре
	пФИО1="";
	Если Не Контрагент.DirectorLastName=Неопределено Тогда
		пФИО1=СокрЛП(Контрагент.DirectorLastName);
	КонецЕсли;
	пФИО2="";
	Если Не Контрагент.DirectorFirstName=Неопределено Тогда
		пФИО2=СокрЛП(Контрагент.DirectorFirstName);
	КонецЕсли;
	пФИО3="";
	Если Не Контрагент.DirectorMiddleName=Неопределено Тогда
		пФИО3=СокрЛП(Контрагент.DirectorMiddleName);
	КонецЕсли;
	Если Не пФИО1+пФИО2+пФИО3="" Тогда
		Сп.Добавить(пФИО1+" "+пФИО2+" "+пФИО3);
	Иначе
		//Для ФОП - наименование
		Если СтрДлина(Контрагент.Identifier) = 10 тогда
			Сп.Добавить(СокрЛП(Контрагент.Name));
		КонецЕсли;
	КонецЕсли;

	СтрДанные=Контрагент.DirectorInformation;
	ДлинаСтроки=СтрДлина(СтрДанные);
	фОбработаноВсе=Ложь;
	пТекНомПоз=1;
	Пока Не фОбработаноВсе Цикл
		пРабочаяСтрока=Сред(СтрДанные, пТекНомПоз, ДлинаСтроки);
		пНомПоз=Найти(пРабочаяСтрока, "; ");
		Если пНомПоз=0 Тогда
			фОбработаноВсе=Истина;
		Иначе
			пТекНомПоз=пТекНомПоз+пНомПоз+2;
			пРабочаяСтрока=Сред(пРабочаяСтрока, 1, пНомПоз);
		КонецЕсли;
		Если пРабочаяСтрока="" Тогда
			Продолжить;
		КонецЕсли;
		пНомПоз=Найти(пРабочаяСтрока, " - ");
		Если пНомПоз>0 Тогда
			пРабочаяСтрока=СокрЛП(Лев(пРабочаяСтрока, пНомПоз - 1));
		КонецЕсли;
		Если Сп.НайтиПоЗначению(пРабочаяСтрока)=Неопределено Тогда
			Сп.Добавить(пРабочаяСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Сп;
	
КонецФункции

Процедура ПолучитьНалогообложение(Контрагент, Параметры)
	Параметры.Налогообложение.Вставить("ОчиститьИНН", Ложь);
	ДатаСтарт = Контрагент.CompanyStartDate;
	Если ДатаСтарт=Неопределено Тогда
		ДатаСтарт=Дата(1, 1, 1, 0, 0, 0);
	Иначе
		ДатаСтарт=Дата(Число(Сред(ДатаСтарт,7,4)),Число(Сред(ДатаСтарт,4,2)),Число(Сред(ДатаСтарт,1,2)));
	КонецЕсли;
	ДатаРегистрацииНДС = Контрагент.VatRegistrationDate;
	Если Не ДатаРегистрацииНДС=Неопределено Тогда
		ДатаРегистрацииНДС=Дата(Число(Сред(ДатаРегистрацииНДС,7,4)),Число(Сред(ДатаРегистрацииНДС,4,2)),Число(Сред(ДатаРегистрацииНДС,1,2)));
		//ДатаРегистрацииНДС_Реал = ДатаРегистрацииНДС;
		Если ДатаРегистрацииНДС>ТекущаяДата() Тогда
			//ДатаРегистрацииНДС=ДатаСтарт;
			Параметры.Налогообложение.Вставить("ОчиститьИНН", Истина);
		КонецЕсли;
	Иначе
		ДатаРегистрацииНДС=ДатаСтарт;
		//ДатаРегистрацииНДС_Реал = ДатаРегистрацииНДС;
	КонецЕсли;
	ДатаАннуляцииНДС = Контрагент.VATCancellationDate;
	Если Не ДатаАннуляцииНДС=Неопределено Тогда
		ДатаАннуляцииНДС=Дата(Число(Сред(ДатаАннуляцииНДС,7,4)),Число(Сред(ДатаАннуляцииНДС,4,2)),Число(Сред(ДатаАннуляцииНДС,1,2)));
	Иначе
		//ДатаАннуляцииНДС=ДатаСтарт;
		ДатаАннуляцииНДС=Дата(1, 1, 1, 0, 0, 0);
	КонецЕсли;
	ДатаЕдиныйНалог = Контрагент.SingleTaxStartDate;
	Если Не ДатаЕдиныйНалог=Неопределено Тогда
		ДатаЕдиныйНалог=Дата(Число(Сред(ДатаЕдиныйНалог,7,4)),Число(Сред(ДатаЕдиныйНалог,4,2)),Число(Сред(ДатаЕдиныйНалог,1,2)));
		Если ДатаЕдиныйНалог>ТекущаяДата() Тогда
			ДатаЕдиныйНалог=ДатаСтарт;
		КонецЕсли;
	Иначе
		ДатаЕдиныйНалог=ДатаСтарт;
	КонецЕсли;
	
	Если Контрагент.TaxSystem = "Єдиний податок" тогда
		Если Контрагент.IndividualTaxNumber = неопределено тогда
			Если ДатаЕдиныйНалог<=ТекущаяДата() Тогда
				Параметры.Налогообложение.Вставить("ПериодНалогообложения", НачалоМесяца(ДатаЕдиныйНалог));
				Параметры.Налогообложение.Вставить("СистемаНалогообложенияТекст", "ЕдиныйНалог");
			КонецЕсли;
		ИначеЕсли ДатаРегистрацииНДС>ТекущаяДата() Тогда
			Параметры.Налогообложение.Вставить("ПериодНалогообложения", НачалоМесяца(ДатаСтарт));
			Параметры.Налогообложение.Вставить("СистемаНалогообложенияТекст", "ЕдиныйНалог");
		Иначе
			Если ДатаЕдиныйНалог<=ТекущаяДата() Тогда
				Если ДатаРегистрацииНДС<=ДатаАннуляцииНДС И ДатаРегистрацииНДС<=ТекущаяДата() И ДатаАннуляцииНДС<=ТекущаяДата() Тогда
					Параметры.Налогообложение.Вставить("ПериодНалогообложения", Макс(НачалоМесяца(ДатаАннуляцииНДС), НачалоМесяца(ДатаЕдиныйНалог)));
					Параметры.Налогообложение.Вставить("СистемаНалогообложенияТекст", "ЕдиныйНалог");
				Иначе
					Параметры.Налогообложение.Вставить("ПериодНалогообложения", Макс(НачалоМесяца(ДатаРегистрацииНДС), НачалоМесяца(ДатаЕдиныйНалог)));
					Параметры.Налогообложение.Вставить("СистемаНалогообложенияТекст", "ЕдиныйНалогИНДС");
				КонецЕсли;
			Иначе
				Если ДатаРегистрацииНДС<=ДатаАннуляцииНДС И ДатаРегистрацииНДС<=ТекущаяДата() И ДатаАннуляцииНДС<=ТекущаяДата() Тогда
					Параметры.Налогообложение.Вставить("ПериодНалогообложения", НачалоМесяца(ДатаАннуляцииНДС));
					Параметры.Налогообложение.Вставить("СистемаНалогообложенияТекст", "НалогНаПрибыль");
				Иначе
					Параметры.Налогообложение.Вставить("ПериодНалогообложения", Макс(НачалоМесяца(ДатаРегистрацииНДС), НачалоМесяца(ДатаСтарт)));
					Параметры.Налогообложение.Вставить("СистемаНалогообложенияТекст", "ЕдиныйНалогИНДС");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Контрагент.TaxSystem = "Податок на прибуток" тогда
		Если Контрагент.IndividualTaxNumber = неопределено тогда
			Если ДатаСтарт<=ТекущаяДата() Тогда
				Параметры.Налогообложение.Вставить("ПериодНалогообложения", НачалоМесяца(ДатаСтарт));
				Параметры.Налогообложение.Вставить("СистемаНалогообложенияТекст", "НалогНаПрибыль");
			КонецЕсли;
		ИначеЕсли ДатаРегистрацииНДС>ТекущаяДата() Тогда
			Параметры.Налогообложение.Вставить("ПериодНалогообложения", НачалоМесяца(ДатаСтарт));
			Параметры.Налогообложение.Вставить("СистемаНалогообложенияТекст", "НалогНаПрибыль");
		Иначе		
			Если ДатаРегистрацииНДС<=ДатаАннуляцииНДС И ДатаРегистрацииНДС<=ТекущаяДата() И ДатаАннуляцииНДС<=ТекущаяДата() Тогда
				Параметры.Налогообложение.Вставить("ПериодНалогообложения", НачалоМесяца(ДатаАннуляцииНДС));
				Параметры.Налогообложение.Вставить("СистемаНалогообложенияТекст", "НалогНаПрибыль");
			Иначе
				Параметры.Налогообложение.Вставить("ПериодНалогообложения", Макс(НачалоМесяца(ДатаРегистрацииНДС), НачалоМесяца(ДатаСтарт)));
				Параметры.Налогообложение.Вставить("СистемаНалогообложенияТекст", "НалогНаПрибыльИНДС");
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Контрагент.TaxSystem = "Неплатник" Тогда
		Если ДатаСтарт<=ТекущаяДата() Тогда
			Параметры.Налогообложение.Вставить("ПериодНалогообложения", НачалоМесяца(ДатаСтарт));
			Параметры.Налогообложение.Вставить("СистемаНалогообложенияТекст", "НеПлательщик");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура Пактум_ЗавершениеПоиска(Парам, фОшибки=Ложь, ТекстОшибки="")
	
	Если Не фОшибки Тогда
		//Запишем Налогообложение
		Если Парам.Налогообложение.Свойство("СистемаНалогообложенияТекст") Тогда
			Если ЗначениеЗаполнено(Парам.Налогообложение.СистемаНалогообложенияТекст) Тогда
				КонтрагентСсылка = Парам.КонтрагентСсылка;
				НаборЗаписей = РегистрыСведений.СхемыНалогообложенияКонтрагентов.СоздатьНаборЗаписей();  			
				ИмяРекв="СхемаНалогообложения";
				Если Парам.Налогообложение.СистемаНалогообложенияТекст="ЕдиныйНалог" Тогда
					Парам.Налогообложение.Вставить("СистемаНалогообложения", Справочники.СхемыНалогообложения.ЕдиныйНалог);
				ИначеЕсли Парам.Налогообложение.СистемаНалогообложенияТекст="ЕдиныйНалогИНДС" Тогда
					Парам.Налогообложение.Вставить("СистемаНалогообложения", Справочники.СхемыНалогообложения.ЕдиныйНалогИНДС);
				ИначеЕсли Парам.Налогообложение.СистемаНалогообложенияТекст="НалогНаПрибыль" Тогда
					Парам.Налогообложение.Вставить("СистемаНалогообложения", Справочники.СхемыНалогообложения.НалогНаПрибыль);
				ИначеЕсли Парам.Налогообложение.СистемаНалогообложенияТекст="НалогНаПрибыльИНДС" Тогда
					Парам.Налогообложение.Вставить("СистемаНалогообложения", Справочники.СхемыНалогообложения.НалогНаПрибыльИНДС);
				ИначеЕсли Парам.Налогообложение.СистемаНалогообложенияТекст="НеПлательщик" Тогда
					Парам.Налогообложение.Вставить("СистемаНалогообложения", Справочники.СхемыНалогообложения.НеПлательщик);
				КонецЕсли;
				Если Не НаборЗаписей=Неопределено Тогда
					НаборЗаписей.Отбор.Период.Установить(Парам.Налогообложение.ПериодНалогообложения);
					НаборЗаписей.Отбор.Контрагент.Установить(КонтрагентСсылка);
					НаборЗаписей.Прочитать();
					Если НаборЗаписей.Количество() = 0 Тогда
						НовыйНомер = НаборЗаписей.Добавить();
						НовыйНомер.Контрагент = КонтрагентСсылка;
						НовыйНомер.Период = Парам.Налогообложение.ПериодНалогообложения;
						НовыйНомер[ИмяРекв] = Парам.Налогообложение.СистемаНалогообложения;
					ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
						НовыйНомер = НаборЗаписей[0];
						НовыйНомер.Контрагент = КонтрагентСсылка;
						НовыйНомер.Период = Парам.Налогообложение.ПериодНалогообложения;
						НовыйНомер[ИмяРекв] = Парам.Налогообложение.СистемаНалогообложения;
					КонецЕсли;
					НаборЗаписей.Записать();	
				Иначе
					Попытка
						Если ЗначениеЗаполнено(КонтрагентСсылка.ИННПлательщикаНДС) И Найти(Парам.Налогообложение.СистемаНалогообложенияТекст, "НДС")>0 Тогда
							Если Не КонтрагентСсылка.ПлательщикНДС Тогда
								Об=КонтрагентСсылка.ПолучитьОбъект();
								Об.ПлательщикНДС=Истина;
								Об.Записать();
							КонецЕсли;
						Иначе
							Если КонтрагентСсылка.ПлательщикНДС Тогда
								Об=КонтрагентСсылка.ПолучитьОбъект();
								Об.ПлательщикНДС=Ложь;
								Об.Записать();
							КонецЕсли;
						КонецЕсли;
					Исключение
					КонецПопытки;
				КонецЕсли;
				Если Найти(Парам.Налогообложение.СистемаНалогообложенияТекст, "НДС")=0 Тогда
					Попытка
						Об=КонтрагентСсылка.ПолучитьОбъект();
						Об.ИНН="";
						Об.Записать();
					Исключение
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Сообщить(НСтр("ru='Код ЕДРПОУ - ';uk='Код ЄДРПОУ - '") + Парам.ЕДРПОУ + ": " + ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТекстОшибкиРеестров(КодОшибки)
	
	Если КодОшибки=1 Тогда
		Возврат НСтр("ru='К сожалению, на данный момент реестр единого налога работает нестабильно. "
"Карточка контрагента заполнена без данных по налогообложению. "
"Запустите повторно заполнение карточки через несколько минут. При повторном заполнении карточки сегодня до 23:59 Ваш баланс не уменьшится.';uk='На жаль, на даний момент реєстру єдиного податку працює нестабільно. "
"Картка контрагента заповнена без даних по оподаткуванню. "
"Запустіть повторно заповнення картки через кілька хвилин. При повторному заповненні картки сьогодні до 23:59 Ваш баланс не зменшиться.'");
	ИначеЕсли КодОшибки=2 Тогда
		Возврат	НСтр("ru='К сожалению, на данный момент реестр НДС работает нестабильно. "
"Карточка контрагента заполнена без данных по налогообложению. "
"Запустите повторно заполнение карточки через несколько минут. При повторном заполнении карточки сегодня до 23:59 Ваш баланс не уменьшится.';uk='На жаль, на даний момент реєстр ПДВ працює нестабільно. "
"Картка контрагента заповнена без даних по оподаткуванню. "
"Запустіть повторно заповнення картки через кілька хвилин. При повторному заповненні картки сьогодні до 23:59 Ваш баланс не зменшиться.'");	
	ИначеЕсли КодОшибки=3 Тогда
		Возврат	НСтр("ru='К сожалению, на данный момент реестры НДС и единого налога работают нестабильно. "
"Карточка контрагента заполнена без данных по налогообложению. "
"Запустите повторно заполнение карточки через несколько минут. При повторном заполнении карточки сегодня до 23:59 Ваш баланс не уменьшится.';uk='На жаль, на даний момент реєстри ПДВ та єдиного податку працюють нестабільно. "
"Картка контрагента заповнена без даних по оподаткуванню. "
"Запустіть повторно заповнення картки через кілька хвилин. При повторному заповненні картки сьогодні до 23:59 Ваш баланс не зменшиться.'");	
	ИначеЕсли КодОшибки=4 Тогда
		Возврат	НСтр("ru='К сожалению, на данный момент Единый государственный реестр работает нестабильно. "
"Карточка контрагента не заполнена. Запустите повторно заполнение карточки через несколько минут. "
"При повторном заполнении карточки сегодня до 23:59 Ваш баланс не уменьшится.';uk='На жаль, на даний момент Єдиний державний реєстр працює нестабільно. "
"Картка контрагента не заповнена. Запустіть повторно заповнення картки через кілька хвилин. "
"При повторному заповненні картки сьогодні до 23:59 Ваш баланс не зменшиться.'");
	ИначеЕсли КодОшибки=5 Тогда
		Возврат	НСтр("ru='К сожалению, на данный момент Единый государственный реестр работает нестабильно. "
"Карточка запрашиваемого контрагента не заполнена. Запустите повторно заполнение карточки через несколько минут. "
"При повторном заполнении карточки сегодня до 23:59 Ваш баланс не уменьшится.';uk='На жаль, на даний момент Єдиний державний реєстр працює нестабільно. "
"Картка контрагента, що запитується, не заповнена. Запустіть повторно заповнення картки через кілька хвилин. "
"При повторному заповненні картки сьогодні до 23:59 Ваш баланс не зменшиться.'");
	Иначе
		Возврат "";			
	КонецЕсли;
	
КонецФункции
